perf/endurance.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: 'artillery-node'

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: WarmUp
      duration: 5
      arrivalRate: 5

    - name: Plain
      duration: 3600
      arrivalRate: 10000
    
    - name: WindDown
      duration: 5
      arrivalRate: 5

scenarios:
  - name: endpoint
    flow:
      - get:
          url: '/ping'