perf/ramp.yaml
config:
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: 'artillery-node'
  target: 'http://localhost:5555'
  variables:
    endpoint:
      - 'ping'

  pool: 50

  phases:
    - name: Ramp
      duration: 120
      arrivalRate: 0
      rampTo: 1000

    - name: Clear
      duration: 20
      arrivalRate: 0

scenarios:
  - name: endpoint
    flow:
      - get:
          url: '/{{ endpoint }}'