perf/spikes.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: 'artillery-node'

  pool: 50

  phases:
    - name: WarmUp
      duration: 10
      arrivalRate: 5

    - name: Base 0
      duration: 60
      arrivalRate: 100
    - name: Spike 1
      duration: 20
      arrivalRate: 1000
    - name: Base 1
      duration: 60
      arrivalRate: 100
    - name: Spike 2
      duration: 20
      arrivalRate: 1000
    - name: Base 2
      duration: 60
      arrivalRate: 100
    - name: Spike 3
      duration: 20
      arrivalRate: 1000
    - name: Base 3
      duration: 60
      arrivalRate: 100

    - name: WindDown
      duration: 10
      arrivalRate: 5

scenarios:
  - name: endpoint
    flow:
      - get:
          url: '/ping'