perf/spikes.yaml
config:
  plugins:
    statsd:
      host: localhost
      port: 8125
      prefix: 'artillery-node'
  target: 'http://localhost:5555'
  variables:
    endpoint:
      - 'ping'

  pool: 50

  phases:
    - name: Base 0
      duration: 45
      arrivalRate: 100
    - name: Spike 1
      duration: 15
      arrivalRate: 1000
    - name: Base 1
      duration: 45
      arrivalRate: 100
    - name: Spike 2
      duration: 15
      arrivalRate: 1000
    - name: Base 2
      duration: 45
      arrivalRate: 100

    - name: Clear
      duration: 10
      arrivalRate: 0

scenarios:
  - name: endpoint
    flow:
      - get:
          url: '/{{ endpoint }}'